Ran Plan for dir: `terraform/stacks/stackkit-test-dev-ap-northeast-2` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
exit status 1: running "set -e\n\n# Extract repo and PR info from environment\nREPO_ORG=$(echo \"$BASE_REPO_OWNER\" | tr '[:upper:]' '[:lower:]')\nREPO_NAME=$(echo \"$BASE_REPO_NAME\" | tr '[:upper:]' '[:lower:]')\nPR_NUM=$PULL_NUM\nCOMMIT_SHA=$(echo \"$HEAD_COMMIT\" | cut -c1-8)\nTIMESTAMP=$(date -u +%Y%m%d%H%M%S)\nPR_URL=\"https://github.com/${BASE_REPO_OWNER}/${BASE_REPO_NAME}/pull/${PR_NUM}\"\n\n# Check if plan was successful\nif [ -f \"$PLANFILE\" ]; then\n  PLAN_STATUS=\"succeeded\"\n  PLAN_COLOR=\"good\"\n  echo \"✅ Plan succeeded - sending Slack notification\"\nelse\n  PLAN_STATUS=\"failed\"\n  PLAN_COLOR=\"danger\"\n  echo \"❌ Plan failed - sending Slack notification\"\nfi\n\n# Generate change analysis for bot consumption\nCHANGE_SUMMARY=\"\"\nRESOURCE_COUNTS=\"\"\nCOST_INFO=\"\"\n\nif [ -n \"$PLANFILE\" ]; then\n  echo \"🔍 DEBUG - Plan 파일 분석:\"\n  echo \"  PLANFILE 경로: $PLANFILE\"\n  echo \"  파일 존재 확인: $([ -f \"$PLANFILE\" ] && echo \"Yes\" || echo \"No\")\"\n  echo \"  파일 크기: $([ -f \"$PLANFILE\" ] && ls -lh \"$PLANFILE\" | awk '{print $5}' || echo \"N/A\")\"\n\n  # Extract resource change counts from plan with enhanced debugging\n  if terraform show -json \"$PLANFILE\" > plan_analysis.json 2>/dev/null; then\n    echo \"  JSON 변환: 성공\"\n\n    # Debug: JSON 구조 분석\n    echo \"🔍 DEBUG - JSON 구조 분석:\"\n    JSON_SIZE=$(wc -c < plan_analysis.json 2>/dev/null || echo \"0\")\n    echo \"  JSON 파일 크기: ${JSON_SIZE} bytes\"\n\n    # JSON 유효성 검사 먼저 수행 (안전장치)\n    set +e\n    JSON_VALID=$(jq empty plan_analysis.json 2>/dev/null && echo \"true\" || echo \"false\")\n    set -e\n    JSON_VALID=${JSON_VALID:-false}\n    echo \"  JSON 유효성: $JSON_VALID\"\n\n    if [[ \"$JSON_VALID\" == \"false\" ]]; then\n      echo \"  ⚠️  JSON 파싱 오류 감지 - 파일 내용 샘플:\"\n      head -c 200 plan_analysis.json || echo \"  파일 읽기 실패\"\n      echo \"\"\n      echo \"  JSON 오류 확인:\"\n      jq empty plan_analysis.json 2>&1 | head -3 || echo \"  jq 오류 확인 실패\"\n      echo \"\"\n      echo \"  대체 방법 시도 중...\"\n    else\n      echo \"  JSON 파싱: 성공\"\n    fi\n\n    # Check for main structure keys (JSON이 유효한 경우에만, 안전장치)\n    if [[ \"$JSON_VALID\" == \"true\" ]]; then\n      set +e\n      HAS_RESOURCE_CHANGES=$(jq 'has(\"resource_changes\")' plan_analysis.json 2>/dev/null)\n      HAS_PLANNED_VALUES=$(jq 'has(\"planned_values\")' plan_analysis.json 2>/dev/null)\n      HAS_CONFIGURATION=$(jq 'has(\"configuration\")' plan_analysis.json 2>/dev/null)\n      set -e\n\n      # 안전한 기본값 설정\n      HAS_RESOURCE_CHANGES=${HAS_RESOURCE_CHANGES:-false}\n      HAS_PLANNED_VALUES=${HAS_PLANNED_VALUES:-false}\n      HAS_CONFIGURATION=${HAS_CONFIGURATION:-false}\n\n      echo \"  JSON 구조 확인:\"\n      echo \"    - resource_changes: $HAS_RESOURCE_CHANGES\"\n      echo \"    - planned_values: $HAS_PLANNED_VALUES\"\n      echo \"    - configuration: $HAS_CONFIGURATION\"\n    else\n      echo \"  JSON 파싱 실패로 구조 확인 불가\"\n      HAS_RESOURCE_CHANGES=\"false\"\n      HAS_PLANNED_VALUES=\"false\"\n      HAS_CONFIGURATION=\"false\"\n    fi\n\n    if [[ \"$HAS_RESOURCE_CHANGES\" == \"true\" ]]; then\n      # Count resource_changes array length\n      RESOURCE_CHANGES_COUNT=$(jq '.resource_changes | length' plan_analysis.json 2>/dev/null || echo \"0\")\n      echo \"    - resource_changes 배열 길이: $RESOURCE_CHANGES_COUNT\"\n\n      # Sample first resource change structure\n      if [[ \"$RESOURCE_CHANGES_COUNT\" -gt \"0\" ]]; then\n        echo \"  첫 번째 resource_change 구조 샘플:\"\n        jq -r '.resource_changes[0] | keys[]' plan_analysis.json 2>/dev/null | head -5 | while read key; do\n          echo \"    - $key\"\n        done\n\n        # Check if change.actions exists\n        FIRST_CHANGE_ACTIONS=$(jq -r '.resource_changes[0].change.actions // \"null\"' plan_analysis.json 2>/dev/null)\n        echo \"    - change.actions: $FIRST_CHANGE_ACTIONS\"\n      fi\n    else\n      echo \"  resource_changes 키가 없음 - 전체 JSON 구조 분석:\"\n      echo \"  JSON 최상위 키들:\"\n      jq -r 'keys[]' plan_analysis.json 2>/dev/null | head -10 | while read key; do\n        echo \"    - $key\"\n      done\n\n      # Try to find alternative structures (안전장치)\n      set +e\n      HAS_PRIOR_STATE=$(jq 'has(\"prior_state\")' plan_analysis.json 2>/dev/null)\n      HAS_RESOURCE_DRIFT=$(jq 'has(\"resource_drift\")' plan_analysis.json 2>/dev/null)\n      HAS_OUTPUT_CHANGES=$(jq 'has(\"output_changes\")' plan_analysis.json 2>/dev/null)\n      set -e\n\n      # 안전한 기본값\n      HAS_PRIOR_STATE=${HAS_PRIOR_STATE:-false}\n      HAS_RESOURCE_DRIFT=${HAS_RESOURCE_DRIFT:-false}\n      HAS_OUTPUT_CHANGES=${HAS_OUTPUT_CHANGES:-false}\n\n      echo \"  대체 구조 확인:\"\n      echo \"    - prior_state: $HAS_PRIOR_STATE\"\n      echo \"    - resource_drift: $HAS_RESOURCE_DRIFT\"\n      echo \"    - output_changes: $HAS_OUTPUT_CHANGES\"\n\n      # Check if this is a different JSON format (안전장치)\n      set +e\n      HAS_DESTROY=$(jq 'has(\"destroy\")' plan_analysis.json 2>/dev/null)\n      HAS_CREATE=$(jq 'has(\"create\")' plan_analysis.json 2>/dev/null)\n      HAS_UPDATE=$(jq 'has(\"update\")' plan_analysis.json 2>/dev/null)\n      set -e\n\n      # 안전한 기본값\n      HAS_DESTROY=${HAS_DESTROY:-false}\n      HAS_CREATE=${HAS_CREATE:-false}\n      HAS_UPDATE=${HAS_UPDATE:-false}\n\n      if [[ \"$HAS_DESTROY\" == \"true\" || \"$HAS_CREATE\" == \"true\" || \"$HAS_UPDATE\" == \"true\" ]]; then\n        echo \"  다른 형식의 plan JSON 감지됨:\"\n        echo \"    - create: $HAS_CREATE\"\n        echo \"    - update: $HAS_UPDATE\"\n        echo \"    - destroy: $HAS_DESTROY\"\n      fi\n    fi\n\n    # Try different jq queries for resource counting\n    echo \"🔍 DEBUG - 다양한 jq 쿼리 테스트:\"\n\n    # Strategy 1: Modern Terraform format (1.7.5+) with resource_changes array\n    if [[ \"$JSON_VALID\" == \"true\" && \"$HAS_RESOURCE_CHANGES\" == \"true\" ]]; then\n      echo \"  🔄 전략 1: Modern Terraform 형식으로 파싱 시도\"\n\n      # Disable exit-on-error temporarily for safer jq execution\n      set +e\n      CREATE_COUNT=$(jq -r '[.resource_changes[]? | select(.change.actions[]? == \"create\")] | length' plan_analysis.json 2>/dev/null)\n      UPDATE_COUNT=$(jq -r '[.resource_changes[]? | select(.change.actions[]? == \"update\")] | length' plan_analysis.json 2>/dev/null)\n      DELETE_COUNT=$(jq -r '[.resource_changes[]? | select(.change.actions[]? == \"delete\")] | length' plan_analysis.json 2>/dev/null)\n      set -e\n\n      # Ensure numeric values\n      CREATE_COUNT=${CREATE_COUNT:-0}\n      UPDATE_COUNT=${UPDATE_COUNT:-0}\n      DELETE_COUNT=${DELETE_COUNT:-0}\n\n      echo \"    원본 쿼리 결과: CREATE=$CREATE_COUNT, UPDATE=$UPDATE_COUNT, DELETE=$DELETE_COUNT\"\n\n      # Alternative query for modern format\n      set +e\n      CREATE_COUNT_ALT1=$(jq -r '[.resource_changes[] | select(.change.actions | contains([\"create\"]))] | length' plan_analysis.json 2>/dev/null)\n      UPDATE_COUNT_ALT1=$(jq -r '[.resource_changes[] | select(.change.actions | contains([\"update\"]))] | length' plan_analysis.json 2>/dev/null)\n      DELETE_COUNT_ALT1=$(jq -r '[.resource_changes[] | select(.change.actions | contains([\"delete\"]))] | length' plan_analysis.json 2>/dev/null)\n      set -e\n\n      # Ensure numeric values\n      CREATE_COUNT_ALT1=${CREATE_COUNT_ALT1:-0}\n      UPDATE_COUNT_ALT1=${UPDATE_COUNT_ALT1:-0}\n      DELETE_COUNT_ALT1=${DELETE_COUNT_ALT1:-0}\n\n      echo \"    대체 쿼리1 결과: CREATE=$CREATE_COUNT_ALT1, UPDATE=$UPDATE_COUNT_ALT1, DELETE=$DELETE_COUNT_ALT1\"\n    else\n      echo \"  ⚠️  전략 1 실패: resource_changes 필드 없음\"\n      CREATE_COUNT=0\n      UPDATE_COUNT=0\n      DELETE_COUNT=0\n      CREATE_COUNT_ALT1=0\n      UPDATE_COUNT_ALT1=0\n      DELETE_COUNT_ALT1=0\n    fi\n\n    # Strategy 2: Try legacy format or alternative structure\n    echo \"  🔄 전략 2: 레거시 형식 또는 대체 구조로 파싱 시도\"\n    set +e\n    HAS_PLANNED_VALUES_RESOURCES=$(jq 'has(\"planned_values\") and (.planned_values | has(\"root_module\")) and (.planned_values.root_module | has(\"resources\"))' plan_analysis.json 2>/dev/null)\n    set -e\n    HAS_PLANNED_VALUES_RESOURCES=${HAS_PLANNED_VALUES_RESOURCES:-false}\n\n    if [[ \"$HAS_PLANNED_VALUES_RESOURCES\" == \"true\" ]]; then\n      # Try to count from planned_values structure (안전장치)\n      set +e\n      PLANNED_RESOURCES_COUNT=$(jq '.planned_values.root_module.resources | length' plan_analysis.json 2>/dev/null)\n      set -e\n      PLANNED_RESOURCES_COUNT=${PLANNED_RESOURCES_COUNT:-0}\n      echo \"    planned_values 리소스 개수: $PLANNED_RESOURCES_COUNT\"\n\n      # For legacy format, assume all resources are creates if no resource_changes\n      if [[ \"$CREATE_COUNT\" == \"0\" && \"$PLANNED_RESOURCES_COUNT\" != \"0\" ]]; then\n        CREATE_COUNT=$PLANNED_RESOURCES_COUNT\n        echo \"    레거시 추정: CREATE=$CREATE_COUNT (planned_values 기반)\"\n      fi\n    fi\n\n    # Strategy 3: Try to parse from terraform plan text output as fallback\n    echo \"  🔄 전략 3: Plan 텍스트 출력에서 파싱 시도\"\n    if [[ -f \"$PLANFILE\" ]]; then\n      PLAN_TEXT=$(terraform show \"$PLANFILE\" 2>/dev/null || echo \"\")\n      if [[ -n \"$PLAN_TEXT\" ]]; then\n        # Extract numbers from plan summary like \"Plan: 3 to add, 2 to change, 1 to destroy\"\n        PLAN_SUMMARY=$(echo \"$PLAN_TEXT\" | grep -E \"Plan: [0-9]+ to add\" | tail -1)\n        if [[ -n \"$PLAN_SUMMARY\" ]]; then\n          CREATE_COUNT_TEXT=$(echo \"$PLAN_SUMMARY\" | sed -n 's/.*Plan: \\([0-9]\\+\\) to add.*/\\1/p' || echo \"0\")\n          UPDATE_COUNT_TEXT=$(echo \"$PLAN_SUMMARY\" | sed -n 's/.* \\([0-9]\\+\\) to change.*/\\1/p' || echo \"0\")\n          DELETE_COUNT_TEXT=$(echo \"$PLAN_SUMMARY\" | sed -n 's/.* \\([0-9]\\+\\) to destroy.*/\\1/p' || echo \"0\")\n\n          echo \"    텍스트 파싱 결과: CREATE=$CREATE_COUNT_TEXT, UPDATE=$UPDATE_COUNT_TEXT, DELETE=$DELETE_COUNT_TEXT\"\n\n          # Use text parsing if JSON parsing failed\n          if [[ \"$CREATE_COUNT\" == \"0\" && \"$CREATE_COUNT_TEXT\" != \"0\" ]]; then CREATE_COUNT=$CREATE_COUNT_TEXT; fi\n          if [[ \"$UPDATE_COUNT\" == \"0\" && \"$UPDATE_COUNT_TEXT\" != \"0\" ]]; then UPDATE_COUNT=$UPDATE_COUNT_TEXT; fi\n          if [[ \"$DELETE_COUNT\" == \"0\" && \"$DELETE_COUNT_TEXT\" != \"0\" ]]; then DELETE_COUNT=$DELETE_COUNT_TEXT; fi\n        fi\n      fi\n    fi\n\n    # Alternative query 2: Direct actions array check\n    ALL_ACTIONS=$(jq -r '[.resource_changes[].change.actions[]] | group_by(.) | map({action: .[0], count: length}) | .[]' plan_analysis.json 2>/dev/null || echo \"[]\")\n    if [[ -n \"$ALL_ACTIONS\" && \"$ALL_ACTIONS\" != \"[]\" ]]; then\n      echo \"  모든 액션 통계:\"\n      echo \"$ALL_ACTIONS\" | jq -r '\"    - \" + .action + \": \" + (.count | tostring)' 2>/dev/null || true\n\n      # Safe jq queries with explicit defaults - won't fail with set -e\n      set +e  # Temporarily disable exit on error for jq queries\n      CREATE_COUNT_ALT2=$(echo \"$ALL_ACTIONS\" | jq -r 'select(.action == \"create\") | .count // 0' 2>/dev/null)\n      UPDATE_COUNT_ALT2=$(echo \"$ALL_ACTIONS\" | jq -r 'select(.action == \"update\") | .count // 0' 2>/dev/null)\n      DELETE_COUNT_ALT2=$(echo \"$ALL_ACTIONS\" | jq -r 'select(.action == \"delete\") | .count // 0' 2>/dev/null)\n      set -e  # Re-enable exit on error\n\n      # Ensure we have numeric values\n      CREATE_COUNT_ALT2=${CREATE_COUNT_ALT2:-0}\n      UPDATE_COUNT_ALT2=${UPDATE_COUNT_ALT2:-0}\n      DELETE_COUNT_ALT2=${DELETE_COUNT_ALT2:-0}\n\n      echo \"  대체 쿼리2 결과: CREATE=$CREATE_COUNT_ALT2, UPDATE=$UPDATE_COUNT_ALT2, DELETE=$DELETE_COUNT_ALT2\"\n    fi\n\n    # Ensure all counts are numeric (fix empty values)\n    CREATE_COUNT=${CREATE_COUNT:-0}\n    UPDATE_COUNT=${UPDATE_COUNT:-0}\n    DELETE_COUNT=${DELETE_COUNT:-0}\n    CREATE_COUNT_ALT1=${CREATE_COUNT_ALT1:-0}\n    UPDATE_COUNT_ALT1=${UPDATE_COUNT_ALT1:-0}\n    DELETE_COUNT_ALT1=${DELETE_COUNT_ALT1:-0}\n    CREATE_COUNT_ALT2=${CREATE_COUNT_ALT2:-0}\n    UPDATE_COUNT_ALT2=${UPDATE_COUNT_ALT2:-0}\n    DELETE_COUNT_ALT2=${DELETE_COUNT_ALT2:-0}\n\n    # Use the best available counts (prefer non-zero results)\n    if [[ \"$CREATE_COUNT\" == \"0\" && \"$CREATE_COUNT_ALT1\" != \"0\" ]]; then CREATE_COUNT=$CREATE_COUNT_ALT1; fi\n    if [[ \"$UPDATE_COUNT\" == \"0\" && \"$UPDATE_COUNT_ALT1\" != \"0\" ]]; then UPDATE_COUNT=$UPDATE_COUNT_ALT1; fi\n    if [[ \"$DELETE_COUNT\" == \"0\" && \"$DELETE_COUNT_ALT1\" != \"0\" ]]; then DELETE_COUNT=$DELETE_COUNT_ALT1; fi\n\n    if [[ \"$CREATE_COUNT\" == \"0\" && \"$CREATE_COUNT_ALT2\" != \"0\" ]]; then CREATE_COUNT=$CREATE_COUNT_ALT2; fi\n    if [[ \"$UPDATE_COUNT\" == \"0\" && \"$UPDATE_COUNT_ALT2\" != \"0\" ]]; then UPDATE_COUNT=$UPDATE_COUNT_ALT2; fi\n    if [[ \"$DELETE_COUNT\" == \"0\" && \"$DELETE_COUNT_ALT2\" != \"0\" ]]; then DELETE_COUNT=$DELETE_COUNT_ALT2; fi\n\n    # Final safety check - ensure all values are numeric\n    CREATE_COUNT=${CREATE_COUNT:-0}\n    UPDATE_COUNT=${UPDATE_COUNT:-0}\n    DELETE_COUNT=${DELETE_COUNT:-0}\n\n    echo \"  최종 선택된 결과: CREATE=$CREATE_COUNT, UPDATE=$UPDATE_COUNT, DELETE=$DELETE_COUNT\"\n\n    RESOURCE_COUNTS=\"create:$CREATE_COUNT|update:$UPDATE_COUNT|delete:$DELETE_COUNT\"\n\n    # Extract top resource types being changed\n    TOP_RESOURCES=$(jq -r '[.resource_changes[]?.type] | group_by(.) | map({type: .[0], count: length}) | sort_by(.count) | reverse | .[0:3] | map(.type + \":\" + (.count | tostring)) | join(\",\")' plan_analysis.json 2>/dev/null || echo \"\")\n\n    if [[ -n \"$TOP_RESOURCES\" ]]; then\n      CHANGE_SUMMARY=\"resources:$TOP_RESOURCES\"\n      echo \"  리소스 유형 통계: $TOP_RESOURCES\"\n    fi\n\n    # Keep JSON file for debugging if needed\n    echo \"  plan_analysis.json 파일 보존 (디버깅용)\"\n  else\n    echo \"  JSON 변환: 실패\"\n    echo \"  대체 방법으로 plan 텍스트 분석 시도...\"\n\n    # Fallback: parse plan text output directly\n    echo \"  Terraform 바이너리 위치: $(which terraform)\"\n    echo \"  Terraform 버전: $(terraform version | head -n1)\"\n\n    PLAN_TEXT=$(terraform show \"$PLANFILE\" 2>&1)\n    SHOW_EXIT_CODE=$?\n\n    echo \"  terraform show 명령 종료 코드: $SHOW_EXIT_CODE\"\n\n    if [[ $SHOW_EXIT_CODE -eq 0 && -n \"$PLAN_TEXT\" ]]; then\n      # 더 정확한 패턴 매칭 사용\n      CREATE_COUNT=$(echo \"$PLAN_TEXT\" | grep -E \"will be created|Plan: .* to add\" | grep -oE '[0-9]+' | head -n1 || echo \"0\")\n      UPDATE_COUNT=$(echo \"$PLAN_TEXT\" | grep -E \"will be updated|will be modified|Plan: .* to change\" | grep -oE '[0-9]+' | head -n1 || echo \"0\")\n      DELETE_COUNT=$(echo \"$PLAN_TEXT\" | grep -E \"will be destroyed|Plan: .* to destroy\" | grep -oE '[0-9]+' | head -n1 || echo \"0\")\n\n      # Plan summary에서 직접 추출 시도\n      PLAN_SUMMARY_LINE=$(echo \"$PLAN_TEXT\" | grep \"Plan:\" | tail -n1)\n\n      if [[ -n \"$PLAN_SUMMARY_LINE\" ]]; then\n        echo \"  Plan summary 발견: $PLAN_SUMMARY_LINE\"\n        CREATE_COUNT=$(echo \"$PLAN_SUMMARY_LINE\" | grep -oE '[0-9]+ to add' | grep -oE '[0-9]+' || echo \"0\")\n        UPDATE_COUNT=$(echo \"$PLAN_SUMMARY_LINE\" | grep -oE '[0-9]+ to change' | grep -oE '[0-9]+' || echo \"0\")\n        DELETE_COUNT=$(echo \"$PLAN_SUMMARY_LINE\" | grep -oE '[0-9]+ to destroy' | grep -oE '[0-9]+' || echo \"0\")\n      fi\n\n      echo \"  텍스트 분석 결과: CREATE=$CREATE_COUNT, UPDATE=$UPDATE_COUNT, DELETE=$DELETE_COUNT\"\n    else\n      echo \"  Plan 파일 읽기 실패 - terraform show 오류:\"\n      echo \"  오류 메시지: $PLAN_TEXT\"\n      CREATE_COUNT=0\n      UPDATE_COUNT=0\n      DELETE_COUNT=0\n    fi\n  fi\nelse\n  echo \"⚠️ PLANFILE 변수가 설정되지 않음\"\n  CREATE_COUNT=0\n  UPDATE_COUNT=0\n  DELETE_COUNT=0\nfi\n\n# Infracost analysis for cost impact\nCOST_INFO=\"\"\necho \"🔍 DEBUG - Infracost 환경 확인:\"\necho \"  INFRACOST_API_KEY 존재: $([ -n \"$INFRACOST_API_KEY\" ] && echo \"Yes (${#INFRACOST_API_KEY} chars)\" || echo \"No\")\"\necho \"  infracost 바이너리: $(command -v infracost >/dev/null 2>&1 && echo \"Found at $(command -v infracost)\" || echo \"Not found\")\"\necho \"  PLANFILE 존재: $([ -n \"$PLANFILE\" ] && [ -f \"$PLANFILE\" ] && echo \"Yes\" || echo \"No\")\"\necho \"  PLANFILE 경로: $PLANFILE\"\necho \"  PLANFILE 크기: $([ -f \"$PLANFILE\" ] && stat -c%s \"$PLANFILE\" 2>/dev/null || echo \"N/A\")\"\n\nif [ -n \"$INFRACOST_API_KEY\" ] && [ -n \"$PLANFILE\" ] && [ -f \"$PLANFILE\" ] && command -v infracost >/dev/null 2>&1; then\n  echo \"💰 Infracost 비용 분석 시작...\"\n\n  # Generate JSON plan for Infracost\n  echo \"🔄 Terraform plan을 JSON으로 변환 중...\"\n  if terraform show -json \"$PLANFILE\" > plan_for_cost.json 2>/dev/null; then\n    echo \"  ✅ JSON 변환 성공 ($(stat -c%s plan_for_cost.json 2>/dev/null || echo \"0\") bytes)\"\n  else\n    echo \"  ⚠️ JSON 변환 실패 - 빈 JSON 사용\"\n    echo \"{}\" > plan_for_cost.json\n  fi\n\n  # Configure Infracost (안전장치 추가)\n  echo \"🔧 Infracost 설정 중...\"\n  # 컨테이너 환경에서는 configure가 실패할 수 있지만 환경변수로 작동함\n  CONFIGURE_OUTPUT=$(infracost configure set api_key \"$INFRACOST_API_KEY\" 2>&1)\n  CONFIGURE_EXIT=$?\n  if [ $CONFIGURE_EXIT -eq 0 ]; then\n    echo \"  ✅ API 키 설정 성공 (파일에 저장됨)\"\n  else\n    echo \"  ⚠️ API 키 파일 설정 실패 (환경변수로 대체)\"\n    echo \"  이유: $(echo \"$CONFIGURE_OUTPUT\" | head -n 1)\"\n    echo \"  환경변수 INFRACOST_API_KEY는 설정되어 있으므로 계속 진행\"\n  fi\n\n  # Get cost breakdown in JSON format for parsing\n  echo \"📊 비용 분석 실행 중...\"\n  echo \"  사용 중인 API 키: ${INFRACOST_API_KEY:0:10}...\"\n  COST_JSON=$(infracost breakdown --path plan_for_cost.json --format json 2>&1)\n  INFRACOST_EXIT_CODE=$?\n\n  if [ $INFRACOST_EXIT_CODE -eq 0 ]; then\n    echo \"  ✅ 비용 분석 성공\"\n    # JSON이 실제로 비용 정보를 포함하는지 확인\n    if echo \"$COST_JSON\" | jq -e '.totalMonthlyCost' >/dev/null 2>&1; then\n      echo \"  💰 실제 비용 데이터 포함\"\n    else\n      echo \"  ⚠️ JSON은 성공했지만 비용 데이터 없음\"\n    fi\n  else\n    echo \"  ⚠️ 비용 분석 실패 (exit code: $INFRACOST_EXIT_CODE)\"\n    echo \"  오류 메시지: $(echo \"$COST_JSON\" | head -n 3)\"\n    COST_JSON='{}'\n  fi\n\n  # Extract monthly cost for Slack metadata (안전장치)\n  set +e\n  MONTHLY_COST=$(echo \"$COST_JSON\" | jq -r '.totalMonthlyCost // \"0\"' 2>/dev/null)\n  set -e\n  MONTHLY_COST=${MONTHLY_COST:-0}\n\n  # Check for cost difference if baseline exists\n  if [ -f \"infracost-base.json\" ]; then\n    COST_DIFF_JSON=$(infracost diff --path plan_for_cost.json --compare-to infracost-base.json --format json 2>/dev/null || echo '{}')\n    set +e\n    COST_DIFF=$(echo \"$COST_DIFF_JSON\" | jq -r '.diffTotalMonthlyCost // \"0\"' 2>/dev/null)\n    set -e\n    COST_DIFF=${COST_DIFF:-0}\n\n    if [[ \"$COST_DIFF\" != \"0\" ]]; then\n      COST_INFO=\"💰 월간 비용: $MONTHLY_COST USD (변화: $COST_DIFF USD)\"\n    else\n      COST_INFO=\"💰 월간 비용: $MONTHLY_COST USD\"\n    fi\n  else\n    COST_INFO=\"💰 월간 비용: $MONTHLY_COST USD\"\n  fi\n\n  # Generate GitHub comment\n  echo \"💬 GitHub 댓글 생성 중...\"\n  if infracost comment github \\\n    --path plan_for_cost.json \\\n    --repo \"$BASE_REPO_OWNER/$BASE_REPO_NAME\" \\\n    --pull-request $PULL_NUM \\\n    --github-token \"$ATLANTIS_GH_TOKEN\" \\\n    --behavior update >/dev/null 2>&1; then\n    echo \"  ✅ GitHub 댓글 생성 성공\"\n  else\n    echo \"  ⚠️ Infracost GitHub 댓글 건너뛰기\"\n  fi\n\n  rm -f plan_for_cost.json\n  echo \"✅ 비용 분석 완료: $COST_INFO\"\nelse\n  echo \"⚠️ Infracost API 키 없음 또는 바이너리 없음 - 비용 분석 건너뛰기\"\n  if [ -z \"$INFRACOST_API_KEY\" ]; then\n    echo \"  -> INFRACOST_API_KEY 환경변수가 설정되지 않음\"\n  fi\n  if ! command -v infracost >/dev/null 2>&1; then\n    echo \"  -> infracost 바이너리를 찾을 수 없음\"\n  fi\nfi\n\n# Generate enhanced Slack message with plan summary and PR link\n# Debug: 변수 값들 확인\necho \"🔍 DEBUG - Plan 분석 변수들:\"\necho \"  CREATE_COUNT=['$CREATE_COUNT']\"\necho \"  UPDATE_COUNT=['$UPDATE_COUNT']\"\necho \"  DELETE_COUNT=['$DELETE_COUNT']\"\necho \"  PLANFILE=['$PLANFILE']\"\n\n# Ensure variables are numeric (default to 0 if empty)\nCREATE_COUNT=${CREATE_COUNT:-0}\nUPDATE_COUNT=${UPDATE_COUNT:-0}\nDELETE_COUNT=${DELETE_COUNT:-0}\n\n# Calculate total changes\nTOTAL_CHANGES=$((CREATE_COUNT + UPDATE_COUNT + DELETE_COUNT))\n\necho \"  정리된 값들 - CREATE:$CREATE_COUNT, UPDATE:$UPDATE_COUNT, DELETE:$DELETE_COUNT\"\necho \"  TOTAL_CHANGES=$TOTAL_CHANGES\"\n\nif [ $TOTAL_CHANGES -gt 0 ]; then\n  PLAN_SUMMARY=\"Plan: $CREATE_COUNT to add, $UPDATE_COUNT to change, $DELETE_COUNT to destroy\"\nelse\n  PLAN_SUMMARY=\"No changes\"\nfi\n\n# Create enhanced message with PR link and cost info (JSON-safe)\nSAFE_REPO_NAME=$(echo \"$REPO_ORG-$REPO_NAME\" | sed 's/[\\\"\\\\]/\\\\&/g')\nSAFE_PLAN_SUMMARY=$(echo \"$PLAN_SUMMARY\" | sed 's/[\\\"\\\\]/\\\\&/g')\nSAFE_COST_INFO=$(echo \"$COST_INFO\" | sed 's/[\\\"\\\\]/\\\\&/g')\n\n# Build PR link safely\nif [ -n \"$PR_URL\" ] && [ -n \"$PR_NUM\" ]; then\n  PR_LINK=\"<$PR_URL|PR #$PR_NUM>\"\nelse\n  PR_LINK=\"PR info unavailable\"\nfi\n\nif [ -n \"$COST_INFO\" ]; then\n  ENHANCED_MESSAGE=\"🏗️ Terraform Plan $PLAN_STATUS for $SAFE_REPO_NAME $PR_LINK\\n$SAFE_PLAN_SUMMARY\\n$SAFE_COST_INFO\"\nelse\n  ENHANCED_MESSAGE=\"🏗️ Terraform Plan $PLAN_STATUS for $SAFE_REPO_NAME $PR_LINK\\n$SAFE_PLAN_SUMMARY\"\nfi\n\n# Create JSON payload with proper escaping\nJSON_PAYLOAD=\"{\\\"text\\\": \\\"$ENHANCED_MESSAGE\\\"}\"\n\n# Send to Slack with performance timing\necho \"📤 Slack 알림 전송 중...\"\nSTART_TIME=$(date +%s.%N)\n\nCURL_RESPONSE=$(curl -s -w \"\\nHTTP_CODE:%{http_code}\\nTOTAL_TIME:%{time_total}\\nSIZE:%{size_download}\"             -X POST             -H 'Content-type: application/json'             -d \"$JSON_PAYLOAD\"             \"$SLACK_WEBHOOK_URL\" 2>/dev/null)\n\nEND_TIME=$(date +%s.%N)\nDURATION=$(echo \"$END_TIME - $START_TIME\" | bc -l 2>/dev/null || echo \"0\")\n\nHTTP_CODE=$(echo \"$CURL_RESPONSE\" | grep \"HTTP_CODE:\" | cut -d: -f2)\nTOTAL_TIME=$(echo \"$CURL_RESPONSE\" | grep \"TOTAL_TIME:\" | cut -d: -f2)\nSIZE=$(echo \"$CURL_RESPONSE\" | grep \"SIZE:\" | cut -d: -f2)\n\nif [ \"$HTTP_CODE\" = \"200\" ]; then\n  echo \"✅ Plan result sent to Slack (성능: ${TOTAL_TIME}s, ${SIZE}bytes)\"\nelse\n  echo \"⚠️ Slack 전송 응답 코드: $HTTP_CODE\"\nfi\necho \"🤖 AI will analyze Atlantis logs and comment on PR shortly...\"\n" in "/atlantis/repos/ryu-qqq/stackkit-test/2/default/terraform/stacks/stackkit-test-dev-ap-northeast-2": 
✅ Plan succeeded - sending Slack notification
🔍 DEBUG - Plan 파일 분석:
  PLANFILE 경로: /atlantis/repos/ryu-qqq/stackkit-test/2/default/terraform/stacks/stackkit-test-dev-ap-northeast-2/2-default.tfplan
  파일 존재 확인: Yes
  파일 크기: 13.1K
  JSON 변환: 성공
🔍 DEBUG - JSON 구조 분석:
  JSON 파일 크기: 51585 bytes
  JSON 유효성: true
  JSON 파싱: 성공
  JSON 구조 확인:
    - resource_changes: true
    - planned_values: true
    - configuration: true
    - resource_changes 배열 길이: 19
  첫 번째 resource_change 구조 샘플:
    - address
    - change
    - mode
    - name
    - provider_name
    - change.actions: [
  "create"
]
🔍 DEBUG - 다양한 jq 쿼리 테스트:
  🔄 전략 1: Modern Terraform 형식으로 파싱 시도
    원본 쿼리 결과: CREATE=19, UPDATE=0, DELETE=0
    대체 쿼리1 결과: CREATE=19, UPDATE=0, DELETE=0
  🔄 전략 2: 레거시 형식 또는 대체 구조로 파싱 시도
    planned_values 리소스 개수: 1
  🔄 전략 3: Plan 텍스트 출력에서 파싱 시도
  모든 액션 통계:
    - create: 19
  대체 쿼리2 결과: CREATE=19, UPDATE=0, DELETE=0
  최종 선택된 결과: CREATE=19, UPDATE=0, DELETE=0
  리소스 유형 통계: aws_subnet:4,aws_route_table_association:4,aws_route_table:2
  plan_analysis.json 파일 보존 (디버깅용)
🔍 DEBUG - Infracost 환경 확인:
  INFRACOST_API_KEY 존재: Yes (36 chars)
  infracost 바이너리: Found at /atlantis/bin/infracost
  PLANFILE 존재: Yes
  PLANFILE 경로: /atlantis/repos/ryu-qqq/stackkit-test/2/default/terraform/stacks/stackkit-test-dev-ap-northeast-2/2-default.tfplan
  PLANFILE 크기: 13462
💰 Infracost 비용 분석 시작...
🔄 Terraform plan을 JSON으로 변환 중...
  ✅ JSON 변환 성공 (51585 bytes)
🔧 Infracost 설정 중...

module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=ap-northeast-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # null_resource.atlantis_test will be created
+ resource "null_resource" "atlantis_test" {
      + id       = (known after apply)
      + triggers = {
          + "timestamp" = (known after apply)
        }
    }

  # module.test_bucket.aws_s3_bucket.main will be created
+ resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "test-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-s3-test-logs"
          + "Project"     = "stackkit-test"
        }
      + tags_all                    = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-s3-test-logs"
          + "Project"     = "stackkit-test"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.test_bucket.aws_s3_bucket_lifecycle_configuration.main[0] will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "main" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "logs_lifecycle"
          + status = "Enabled"

          + filter {
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
        }
    }

  # module.test_bucket.aws_s3_bucket_public_access_block.main will be created
+ resource "aws_s3_bucket_public_access_block" "main" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.test_bucket.aws_s3_bucket_server_side_encryption_configuration.main will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = false

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.test_bucket.aws_s3_bucket_versioning.main will be created
+ resource "aws_s3_bucket_versioning" "main" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.vpc.aws_internet_gateway.main will be created
+ resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-igw"
          + "Project"     = "stackkit-test"
        }
      + tags_all = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-igw"
          + "Project"     = "stackkit-test"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route_table.private[0] will be created
+ resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-rt-1"
          + "Project"     = "stackkit-test"
        }
      + tags_all         = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-rt-1"
          + "Project"     = "stackkit-test"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
+ resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-rt"
          + "Project"     = "stackkit-test"
        }
      + tags_all         = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-rt"
          + "Project"     = "stackkit-test"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
+ resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_security_group.default will be created
+ resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "stackkit-test-dev-default-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-default-sg"
          + "Project"     = "stackkit-test"
        }
      + tags_all               = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-default-sg"
          + "Project"     = "stackkit-test"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-subnet-1"
          + "Project"     = "stackkit-test"
          + "Type"        = "Private"
        }
      + tags_all                                       = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-subnet-1"
          + "Project"     = "stackkit-test"
          + "Type"        = "Private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-subnet-2"
          + "Project"     = "stackkit-test"
          + "Type"        = "Private"
        }
      + tags_all                                       = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-private-subnet-2"
          + "Project"     = "stackkit-test"
          + "Type"        = "Private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-subnet-1"
          + "Project"     = "stackkit-test"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-subnet-1"
          + "Project"     = "stackkit-test"
          + "Type"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-subnet-2"
          + "Project"     = "stackkit-test"
          + "Type"        = "Public"
        }
      + tags_all                                       = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-public-subnet-2"
          + "Project"     = "stackkit-test"
          + "Type"        = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
+ resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-vpc"
          + "Project"     = "stackkit-test"
        }
      + tags_all                             = {
          + "Component"   = "stackkit-test"
          + "CreatedBy"   = "stackkit-cli"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "stackkit-test-dev-vpc"
          + "Project"     = "stackkit-test"
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ private_subnet_ids = [
      + (known after apply),
      + (known after apply),
    ]
+ public_subnet_ids  = [
      + (known after apply),
      + (known after apply),
    ]
+ stack_name         = "stackkit-test-dev-ap-northeast-2"
+ test_bucket_arn    = (known after apply)
+ test_bucket_name   = "test-logs"
+ vpc_cidr_block     = "10.0.0.0/16"
+ vpc_id             = (known after apply)

```
</details>

